[{"cwe":"89","description":"Se generan sentencias SQL dinámicas sin la validación requerida de datos y sin utilizar sentencias parametrizadas o procedimientos almacenados.","recommendation":"Realizar las consultas a la base de datos por medio de sentencias o procedimientos parametrizados.","requirements":"REQ.0169. Debe usarse construcciones parametrizadas o procedimientos almacenados parametrizados para la creación dinámica de sentencias (ej: java.sql.PreparedStatement)","title":"FIN.S.0001. Inyección SQL","type":"SECURITY"},{"cwe":"400","description":"Se genera la caída del servidor como resultado de ataques de amplificación, en donde una petición genera múltiples respuestas.","recommendation":"Definir un time-out cuando una consulta o una búsqueda se está demorando mucho en procesar la información.","requirements":"REQ.0072. El tiempo de respuesta con la concurrencia máxima esperada debe ser de no más de 5 segundos.","title":"FIN.S.0002. Denegación de servicio asimétrica","type":"SECURITY"},{"cwe":"400","description":"Se genera la caída del servidor con múltiples peticiones a una funcionalidad específica la cual consume muchos recursos o se demora en procesar la información.","recommendation":"Definir un time-out cuando una consulta o una búsqueda se está demorando mucho en procesar la información.","requirements":"REQ.0072. El tiempo de respuesta con la concurrencia máxima esperada debe ser de no más de 5 segundos.","title":"FIN.S.0003. Denegación de servicio simétrica","type":"SECURITY"},{"cwe":"94","description":"Se ejecutan comandos en la consola del servidor gracias a peticiones mal configuradas, software desactualizado, funciones inseguras.","recommendation":"- Asegurarse de que ninguna petición utilice funciones inseguras que ejecuten comando en el sistema operativo.\n- Asegurarse de que los componentes de la aplicación estén actualizados ya que estos pueden permitir ejecutar comandos gracias a múltiples vulnerabilidades.","requirements":"REQ.0265. El sistema debe restringir el acceso a funciones del sistema que ejecutan procesos críticos de negocio. sólo permitirá acceso a usuarios autorizados.\nREQ.0266. La organización debe deshabilitar las funciones inseguras de un sistema. (hardening de sistemas)","title":"FIN.S.0004. Ejecución remota de comandos","type":"SECURITY"},{"cwe":"264","description":"Los roles administrativos son accedidos desde funciones de un usuario estándar debido a una mala configuración de los roles dentro de la aplicación.","recommendation":"Los roles deben ser controlados con tokens de usuario o se debe evitar la exposición de identificadores de usuario.","requirements":"REQ.0035. El sistema no debe permitir a un actor del sistema, aumentar los privilegios para él mismo.","title":"FIN.S.0005. Elevación de privilegios","type":"SECURITY"},{"cwe":"306","description":"Un atacante puede ganar acceso a la aplicación si mediante el método de fuerza bruta adquiere credenciales válidas ya que el sistema no cuenta con un incremento en el tiempo de login o verificación si quien realiza el proceso es un humano.\n","recommendation":"Poner para todo recurso con una funcionalidad crítica para el negocio un proceso de autenticación fuerte y asegurarse de que cada usuario que intente acceder tenga una sesión iniciada.","requirements":"REQ.0227. El sistema debe notificar a cualquier actor que intenta autenticarse, que el acceso en el mismo sistema sólo está disponible para usuarios autorizados.","title":"FIN.S.0006. Ausencia o evasión de autenticación","type":"SECURITY"},{"cwe":"352","description":"La aplicación permite engañar a un usuario autenticado por medio de links manipulados para ejecutar acciones sobre la aplicación sin su consentimiento.","recommendation":"Hacer uso de tokens en los formularios para la verificación de las peticiones realizadas por usuarios legítimos.\n","requirements":"REQ.0174. La aplicación debe garantizar que las peticiones que ejecuten transacciones no sigan un patrón discernible.","title":"FIN.S.0007. Cross site request forgery","type":"SECURITY"},{"cwe":"79","description":"Los campos de la aplicación permiten inyectar código JavaScript haciendo posible a un atacante comprometer la sesión del usuario.","recommendation":"Filtrar la información que recibe y envía la aplicación por medio de listas blancas","requirements":"REQ.0173. El sistema debe descartar toda la información potencialmente insegura que sea recibida por entradas de datos.","title":"FIN.S.0008. Cross site scripting reflejado","type":"SECURITY"},{"cwe":"798","description":"En el repositorio se encuentra almacenada informacion sensible como usuarios, contraseñas, correos electronicos, IPs, entre otros.","recommendation":"Se recomienda cargar los datos sensibles desde:\n - Un servicio de bóveda de claves\n - Un archivo de configuración que esté debidamente cifrado\n - Variables de entorno administrativas","requirements":"REQ.0156. El código fuente no debe contener información sensible.","title":"FIN.S.0009. Información sensible almacenada en el código fuente","type":"SECURITY"},{"cwe":"79","description":"Los campos de la aplicación permiten inyectar código de forma persistente para que posteriormente cualquier usuario que ingrese a la plataforma sea afectado, permitiendo el robo de información o la distribución de software malicioso.","recommendation":"Filtrar la información que recibe y envía la aplicación por medio de listas blancas","requirements":"REQ.0173. El sistema debe descartar toda la información potencialmente insegura que sea recibida por entradas de datos.","title":"FIN.S.0010. Cross site scripting almacenado","type":"SECURITY"},{"cwe":"937","description":"Se encuentra software desactualizado con vulnerabilidades.","recommendation":"Actualizar el software afectado a sus versiones recomendadas por el fabricante.","requirements":"REQ.0262. Los componentes provistos por terceros deben corresponder a versiones estables, probadas y actualizadas.","title":"FIN.S.0011. Uso de componentes con vulnerabilidades conocidas","type":"SECURITY"},{"cwe":"285","description":"Las funciones de la aplicación son accedidas sin necesidad de tener una sesión iniciada en el servidor.","recommendation":"Proteger los recursos a los cuales no se les tiene una autenticación para ser accedidos.","requirements":"REQ.0264. El sistema debe requerir autenticación para todos los recursos, excepto para la consulta o visualización de aquellos específicamente clasificados como públicos.","title":"FIN.S.0012. Acceso a recursos protegidos sin autenticación","type":"SECURITY"},{"cwe":"639","description":"-","recommendation":"Verificar que el usuario que está intentando acceder a la información efectivamente tenga los permisos necesarios para hacerlo.\n","requirements":"REQ.0176. El sistema debe restringir el acceso a objetos del sistema que tengan contenido sensible. Sólo permitirá su acceso a usuarios autorizados.","title":"FIN.S.0013. Referencia insegura a objetos","type":"SECURITY"},{"cwe":"749","description":"-","recommendation":"-","requirements":"REQ.0266. La organización debe deshabilitar las funciones inseguras de un sistema. (hardening de sistemas)","title":"FIN.S.0014. Funcionalidad insegura","type":"SECURITY"},{"cwe":"951","description":"Uso de métodos de autenticación inseguros como Basic HTTP.","recommendation":"Implementar mecanismos de autenticación más seguros como aquellos basados en formularios.","requirements":"REQ.0030. Se debe controlar que un objeto (id de sesión, cookie, etc) que participe en el proceso de autenticación no pueda ser reutilizado.","title":"FIN.S.0015. Método de autenticación inseguro","type":"SECURITY"},{"cwe":"320","description":"La llave de cifrado se encuentra almacenada en el código fuente en texto plano y no se obtiene de una fuente segura que garantice su confidencialidad.","recommendation":"Se recomienda cargar las llaves de cifrado desde:\n - Un servicio de bóveda de claves\n - Un archivo de configuración que esté debidamente cifrado\n - Variables de entorno administrativas","requirements":"REQ.0145. Las llaves asimétricas privadas o simétricas del sistema deben estar protegidas y no deben ser expuestas.\nREQ.0156. El código fuente no debe contener información sensible.","title":"FIN.S.0016. Llave de cifrado no parametrizable","type":"SECURITY"},{"cwe":"319","description":"Algunos parámetros pueden visualizarse ya que se están enviando a través de la URL. Un atacante puede interceptar la información y capturar la información.","recommendation":"Garantizar que las credenciales sean enviadas por un canal más seguro como variables de sesión o por el método HTTP POST.\n","requirements":"REQ.0032. El sistema no debe exponer identificadores de sesión en URLs y mensajes presentados al usuario.","title":"FIN.S.0017. Información sensible enviada de forma insegura","type":"SECURITY"},{"cwe":"732","description":"Las carpetas de red pueden ser accedidas sin ningún tipo de credencial permitiendo el acceso a información confidencial","recommendation":"Limitar el acceso a carpetas compartidas solo a personal autorizado y con las credenciales respectivas.","requirements":"REQ.0264. El sistema debe requerir autenticación para todos los recursos, excepto para la consulta o visualización de aquellos específicamente clasificados como públicos.","title":"FIN.S.0018. Carpetas compartidas sin control","type":"SECURITY"},{"cwe":"524","description":"Es posible extraer credenciales administrativas desde la caché de los procesos ","recommendation":"Evitar almacenar información sensible en archivos temporales o en caché\r","requirements":"REQ.0177. El sistema no debe almacenar información sensible en archivos temporales o en memoria caché.","title":"FIN.S.0019. Credenciales de administrador guardadas en caché de procesos","type":"SECURITY"},{"cwe":"311","description":"La información confidencial es almacenada en texto plano permitiendo a un atacante visualizarla sin ningún tipo de cifrado.","recommendation":"Cifrar toda información sensible que se transporte o se guarde dentro la aplicación de acuerdo a las políticas de la organización.","requirements":"REQ.0185. La información sensible almacenada debe estar cifrada.","title":"FIN.S.0020. Ausencia de cifrado de información confidencial","type":"SECURITY"},{"cwe":"91","description":"Inyección de sentencias XPath lo que permite la lectura arbitraria de datos pertenecientes a otras entidades diferentes a las especificadas por la funcionalidad de la aplicación.","recommendation":"Manejar las rutas y expresiones XPath desde el código que es ejecutado en el servidor en lugar de hacerlo en el cliente.\r","requirements":"REQ.0173. El sistema debe descartar toda la información potencialmente insegura que sea recibida por entradas de datos.","title":"FIN.S.0021. Inyección XPath","type":"SECURITY"},{"cwe":"319","description":"La información de los clientes es transmitida por un canal que no usa cifrado, por lo cual pueden ser capturadas en texto plano credenciales e información confidencial.","recommendation":"Desplegar la aplicación sobre un canal de comunicación cifrado, como por ejemplo: HTTPS + TLS.","requirements":"REQ.0181. La transmisión de información sensible o la ejecución de funciones sensibles debe hacerse a través de protocolos seguros.","title":"FIN.S.0022. Uso de canal inseguro","type":"SECURITY"},{"cwe":"601","description":"Las redirecciones hechas por la aplicación no son controladas y podrían ser manipuladas por un atacante.","recommendation":"Usar parámetros predefinidos y no información que pueda ser manipulada por el usuario para la redirección a sitios web en la aplicación.\r","requirements":"REQ.0173. El sistema debe descartar toda la información potencialmente insegura que sea recibida por entradas de datos.","title":"FIN.S.0023. Redirección a sitios externos no controlada","type":"SECURITY"},{"cwe":"0","description":"La red no limita actualmente el acceso entre segmentos de red, por lo cual un empleado de cualquier oficina puede acceder a servicios administrativos en servidores y en otras oficinas, así como a equipos de empleados de altos cargos.","recommendation":"Segmentar la red corporativa utilizando el principio de mínimo privilegio necesario para limitar los accesos entre los diferentes equipos.","requirements":"REQ.0255. Los segmentos de usuarios y servidores con aplicaciones o contenido deben permitir acceso sólo a los puertos necesarios.","title":"FIN.S.0024. Acceso no restringido entre segmentos de red","type":"SECURITY"},{"cwe":"358","description":"Es posible interceptar las llamadas realizadas y recibidas a través de la plataforma VoIP debido a que la comunicación no viaja cifrada.","recommendation":"Configurar el canal con TLS o SRTP + TLS o configurar un firewall para cifrar las llamadas.","requirements":"REQ.0181. La transmisión de información sensible o la ejecución de funciones sensibles debe hacerse a través de protocolos seguros.","title":"FIN.S.0025. Interceptación de llamadas","type":"SECURITY"},{"cwe":"204","description":"Debido a una práctica inadecuada en la configuración se pueden enumerar los usuarios válidos en la aplicación.","recommendation":"Implementar mensajes de error genéricos que no le permitan a un atacante discernir la existencia del usuario en el sistema a través de los errores HTTP (500 o 404) .","requirements":"REQ.0225. Las respuestas del sistema a los fallos de autenticación no deben indicar cual parte de la autenticación fue incorrecta.","title":"FIN.S.0026. Enumeración de usuarios","type":"SECURITY"},{"cwe":"434","description":"El sistema de carga de archivos permite cargar archivos con doble extensión y extensiones inseguras como (.html, .php, .exe), tampoco se valida si el archivo está libre de código malicioso o no.","recommendation":"- Validar con expresiones regulares que el archivo corresponda con una sola extensión\n- Validar con un antivirus que el archivo no contenga ningún tipo de código malicioso.","requirements":"REQ.0040. El sistema debe validar que el formato (estructura) de los archivos corresponda con su extensión.\nREQ.0041. El sistema debe validar que el contenido de los archivos transferidos hacia el mismo sistema esté libre de código malicioso.","title":"FIN.S.0027. Carga insegura de archivos","type":"SECURITY"},{"cwe":"377","description":"-","recommendation":"-","requirements":"REQ.0036. El sistema no debe desplegar archivos temporales en ambiente de producción.\nREQ.0177. El sistema no debe almacenar información sensible en archivos temporales o en memoria caché.","title":"FIN.S.0028. Archivos temporales inseguros","type":"SECURITY"},{"cwe":"434","description":"No existe un control adecuado sobre el tamaño de los archivos que se pueden subir al servidor.","recommendation":"Implementar controles para limitar el máximo tamaño de archivos permitido.","requirements":"REQ.0039. Los archivos operados en un sistema y los manipulados por los usuarios deben tener un tamaño máximo definido (5MB recomendado)","title":"FIN.S.0029. Control inadecuado de tamaño de archivos","type":"SECURITY"},{"cwe":"598","description":"El ID de sesión es enviado por método GET.\n\nEstos parámetros:\n- son almacenados en el historial del navegador permitiendo su visualización.\n- son enviados en la cabecera HTTP referer a otros sitios.\n- son enviados como petición a sitios externos al poner la url en la barra del navegador si este lo interpreta como consulta.\n- son visibles por scripts corriendo en la página los cuales pueden pertenecer a terceros.","recommendation":"Garantizar que los identificadores de sesión se envían por métodos seguros (POST) u obtener la sesión de las cookies.","requirements":"REQ.0032. El sistema no debe exponer identificadores de sesión en URLs y mensajes presentados al usuario.","title":"FIN.S.0030. Parámetros enviados por URL","type":"SECURITY"},{"cwe":"926","description":"La aplicación tiene permisos innecesarios activos sobre recursos del equipo permitiendo a un atacante ganar privilegios y ejecutar acciones aprovechando los permisos activados por la aplicación.","recommendation":"Deshabilitar permisos innecesarios para el funcionamiento de la aplicación.","requirements":"REQ.0266. La organización debe deshabilitar las funciones inseguras de un sistema. (hardening de sistemas)","title":"FIN.S.0031. Permisos de aplicación innecesarios","type":"SECURITY"},{"cwe":"556","description":"Suplantación de usuarios al modificar desde cuentas no privilegiadas datos sensibles de cuentas privilegiadas (nombres, correo, delegados, entre otros).","recommendation":"Usar control de acceso a nivel de sesión para evitar que hayan transacciones que modifiquen información de otros usuarios basado únicamente el el ID.","requirements":"REQ.0035. El sistema no debe permitir a un actor del sistema, aumentar los privilegios para él mismo.","title":"FIN.S.0032. Suplantación de usuario","type":"SECURITY"},{"cwe":"620","description":"Al establecer una nueva contraseña para un usuario, el producto no requiere conocimiento de la contraseña original, o el uso de otro tipo de autenticación.","recommendation":"Garantizar que al hacer el cambio de contraseña se ingrese la contraseña actual.","requirements":"REQ.0238. El sistema debe garantizar que la persona que realiza el proceso de restablecimiento de contraseña sea realmente el propietario.","title":"FIN.S.0033. Cambio de contraseña sin verificar","type":"SECURITY"},{"cwe":"330","description":"Se utilizan funciones y rangos para la generación de números aleatorios que permiten a un usuario no autorizado determinar en poco tiempo la combinación utilizada","recommendation":"Usar los mecanismos más seguros ofrecidos por el lenguaje para la generación de números aleatorios","requirements":"REQ.0223. Los números aleatorios generados deben seguir una distribución uniforme.\nREQ.0224. Debe usarse el mecanismo criptográfico más seguro ofrecido por la plataforma (ej: java.security.SecureRandom) para la generación de números aleatorios usados en procesos críticos (ej: generación de ID, mapeo de códigos, llaves).","title":"FIN.S.0034. Generación de números aleatorios inseguros","type":"SECURITY"},{"cwe":"521","description":"La política de credenciales presente en el sistema no cuenta con los parámetros recomendados.","recommendation":"Establecer una política para la creación de credenciales que involucre frases y no contraseñas basadas en palabras.","requirements":"REQ.0132. Las contraseñas (tipo frase) deben tener al menos 3 palabras de longitud.","title":"FIN.S.0035. Política de credenciales débiles","type":"SECURITY"},{"cwe":"642","description":"La información de estado de formularios almacenada en el ViewState no se encuentra cifrada. ","recommendation":"Establecer cifrado de la variable ViewState en la configuración de la aplicación","requirements":"REQ.0026. El sistema debe verificar la integridad y cifrar los estados de sesión que están al lado del cliente.","title":"FIN.S.0036. ViewState no cifrado","type":"SECURITY"},{"cwe":"200","description":"Se obtiene información técnica del sistema, como:\n- versión de los componentes que el sistema utiliza (encabezados HTTP, banner del servicio, etc)\n- información específica sobre la configuración componentes a nivel del servidor\n (php.ini, web.config)\n- Funcionalidades que arrojan información del servidor.","recommendation":"Eliminar el banner de los servicios con fuga de información. Verificar que los encabezados HTTP no expongan ningún nombre o versión.","requirements":"REQ.0077. La aplicación no debe revelar detalles del sistema interno como stack traces, fragmentos de sentencias SQL y nombres de base de datos o tablas.\nREQ.0176. El sistema debe restringir el acceso a objetos del sistema que tengan contenido sensible. Sólo permitirá su acceso a usuarios autorizados.","title":"FIN.H.0037. Fuga de información técnica","type":"HYGIENE"},{"cwe":"200","description":"Se obtiene información de negocio, como:\n- Lista de usuarios\n- Información estratégica\n- Información de empleados\n- Información de clientes\n- Información de proveedores","recommendation":"De acuerdo a la clasificación de la información encontrada, establecer los controles necesarios para que la información sea accesible sólo a las personas indicadas.","requirements":"REQ.0176. El sistema debe restringir el acceso a objetos del sistema que tengan contenido sensible. Sólo permitirá su acceso a usuarios autorizados.","title":"FIN.S.0038. Fuga de información de negocio","type":"SECURITY"},{"cwe":"287","description":"-","recommendation":"-","requirements":"REQ.0176. El sistema debe restringir el acceso a objetos del sistema que tengan contenido sensible. Sólo permitirá su acceso a usuarios autorizados.","title":"FIN.S.0039. Uso de web services sin autorización","type":"SECURITY"},{"cwe":"306","description":"-","recommendation":"-","requirements":"REQ.0176. El sistema debe restringir el acceso a objetos del sistema que tengan contenido sensible. Sólo permitirá su acceso a usuarios autorizados.","title":"FIN.H.0040. Web Services expuestos","type":"HYGIENE"},{"cwe":"259","description":"Se encuentran credenciales por defecto de baja fortaleza las cuales aún están presentes en la base de datos de la aplicación.","recommendation":"Eliminar las credenciales del gestor de almacenamiento para evitar inicios de sesión con estas.","requirements":"REQ.0142. La organización debe modificar todas las credenciales de acceso por defecto de sistemas empaquetados.","title":"FIN.S.0041. Credenciales por defecto activadas","type":"SECURITY"},{"cwe":"614","description":"Las Cookies son generadas en la aplicación sin las banderas HTTPOnly y Secure lo que facilita el compromiso de la sesión del usuario a través de ataques tipo Cross-Site Scripting.","recommendation":"Agregar los atributos HTTPOnly, SameSite y, si se está usando SSL en la aplicación, el atributo Secure.","requirements":"REQ.0029. Las cookies de sesión de aplicaciones Web deben tener atributos de seguridad (HttpOnly, Secure)","title":"FIN.S.0042. Cookies generadas de forma insegura","type":"SECURITY"},{"cwe":"644","description":"El servidor carece de algunos encabezados HTTP que le permiten evitar ataques como el clickjacking y Cross-Site Scripting a las páginas que están alojadas en él.","recommendation":"Establecer las cabeceras HTTP de seguridad: \n- access-control-allow-origin\n- content-security-policy\n- x-permitted-cross-domain-policies\n- strict-transport-security (Si usa SSL)\n- x-frame-options\n- x-xss-protection\n- cache-control.","requirements":"REQ.0062. Debe definirse configuraciones estándares que corrijan todas las vulnerabilidades conocidas y que sean consistentes con estándares de la industria (ej: líneas base).","title":"FIN.H.0043. Cabeceras de seguridad HTTP no establecidas","type":"HYGIENE"},{"cwe":"749","description":"Métodos como :\n\nTRACE,PUT,DELETE\n\nSe encuentran habilitados en el servidor permitiendo al atacante incluir y/o borrar archivos, permite saber cuales otros métodos son permitidos o usar la depuración en las página que lo permiten.","recommendation":"Configurar los métodos seguros para las peticiones en el servidor.","requirements":"REQ.0266. La organización debe deshabilitar las funciones inseguras de un sistema. (hardening de sistemas)","title":"FIN.H.0044. Métodos HTTP Inseguros Habilitados","type":"HYGIENE"},{"cwe":"94","description":"Los campos de la aplicación permiten inyectar código HTML lo cual posibilita cambiar el aspecto de la página engañando a las víctimas una vez consultada la funcionalidad afectada.","recommendation":"Filtrar la información que venga de los campos de texto con expresiones regulares o listas blancas para evitar inyecciones.","requirements":"REQ.0173. El sistema debe descartar toda la información potencialmente insegura que sea recibida por entradas de datos.","title":"FIN.S.0045. Inyección de código (HTML)","type":"SECURITY"},{"cwe":"656","description":"-","recommendation":"-","requirements":"REQ.0159. El código fuente debe estar ofuscado en ambiente de producción.","title":"FIN.H.0046. Binarios no ofuscados","type":"HYGIENE"},{"cwe":"203","description":"Se enumeran los servicios disponibles en los servidores mediante un escaneo, permitiendo así saber cuáles están activos y cuáles se pueden consumir.","recommendation":"Filtrar la información que se recibe por los puertos para que un escaneo no detecte los servicios que corren en dicho puerto.","requirements":"REQ.0266. La organización debe deshabilitar las funciones inseguras de un sistema. (hardening de sistemas)\nREQ.0263. El sistema debe tener mecanismos de protección contra robots que indexen información, landings o recursos","title":"FIN.S.0047. Enumeración automática de información","type":"SECURITY"},{"cwe":"250","description":"No se está detectando si el sistema Android se encuentra rooteado al utilizar la aplicación.","recommendation":"Notificar a los usuarios al momento de ejecutar la aplicación que se detectó el teléfono rooteado y los riesgos asociados.","requirements":"REQ.0266. La organización debe deshabilitar las funciones inseguras de un sistema. (hardening de sistemas)","title":"FIN.S.0048. Falta de detección de sistemas rooteados","type":"SECURITY"},{"cwe":"295","description":"El certificado no cumple con las mejores prácticas recomendadas.\n\n**Especificar que practicas no se están cumpliendo**","recommendation":"Generar un certificado que cumpla con las mejores prácticas recomendadas.","requirements":"REQ.0088. Un sistema con información crítica para el negocio debe requerir certificados digitales de cliente en el proceso de autenticación.\nREQ.0089. La organización no debe utilizar certificados digitales con una vigencia superior a dos años.\nREQ.0090. El sistema debe utilizar certificados digitales que no se encuentren vencidos.\nREQ.0091. Debe utilizarse certificados firmados por entidades certificadoras internas válidas cuando estos sean para aplicaciones internas.\nREQ.0092. Debe utilizarse certificados firmados por entidades certificadoras externas válidas cuando estos sean para aplicaciones externas.\nREQ.0093. Debe utilizarse certificados con una identificación coherente con la organización (servicio, servidor, entre otros) a la cual se encuentra asociado.\nREQ.0150. Debe utilizarse funciones resumen con un tamaño mínimo de 256 bits.","title":"FIN.S.0049. Certificados Digitales Inseguros","type":"SECURITY"},{"cwe":"521","description":"La falta de complejidad de las contraseñas reduce significativamente el tiempo de búsqueda cuando se trata de adivinar las contraseñas de los usuarios, por lo que un atacante puede realizar ataques de fuerza bruta y tener éxito más rápido.","recommendation":"Hacer cumplir el uso de contraseñas seguras. \nUna política de seguridad de la contraseña debe contener los siguientes atributos:\n- Configurar una longitud mínima y máxima\n- No contraseñas basadas en palabras.\n- No contener nombres de usuario.\n- No reutilizar contraseñas.","requirements":"REQ.0132. Las contraseñas (tipo frase) deben tener al menos 3 palabras de longitud.","title":"FIN.S.0050. Claves débiles adivinadas","type":"SECURITY"},{"cwe":"916","description":"La falta de complejidad de los hashes almacenados en la base de datos reduce significativamente el tiempo del proceso de reversado.","recommendation":"Asegurarse de que las funciones de resumen de contraseñas tenga un tamaño mínimo de 256 bits.","requirements":"REQ.0150. Deben utilizarse funciones resumen con un tamaño mínimo de 256 bits.\nREQ.0134. El sistema debe almacenar las contraseñas con diferentes derivaciones de clave (Salt).\nREQ.0135. Las derivaciones de clave (Salt), deben ser aleatorias y de mínimo 48 bits.","title":"FIN.S.0051. Claves debiles reversadas","type":"SECURITY"},{"cwe":"326","description":"El servidor donde se almacena la aplicación soporta cifrados inseguros (especificar cuáles)","recommendation":"Solamente se deben permitir cifrados seguros con algoritmos seguros como TLSv1.2 o Superior.","requirements":"REQ.0148. Debe utilizarse como mecanismo de cifrado asimétrico un tamaño de clave mínimo de 2048 bits.\nREQ.0149. Debe utilizarse como mecanismo de cifrado simétrico un tamaño de clave mínimo de 128 bits.\nREQ.0150. Deben utilizarse funciones resumen con un tamaño mínimo de 256 bits.\nREQ.0181. La transmisión de información sensible o la ejecución de funciones sensibles debe hacerse a través de protocolos seguros.","title":"FIN.S.0052. Algoritmo de cifrado inseguro","type":"SECURITY"},{"cwe":"307","description":"La aplicación no tiene protección contra ataques automatizados para adivinar credenciales válidas.","recommendation":"Implementar un control para evitar este tipo de ataques y que garantice que el acceso no sea de un robot. Ej captcha, bloqueo por retardo en el número de intentos fallidos, etc.","requirements":"REQ.0237. El sistema debe garantizar que quien realiza las acciones de registro, autenticación y restablecimiento de contraseña es un humano (usando CAPTCHA o retrasos incrementales)","title":"FIN.S.0053. Ausencia de protección contra ataques de fuerza bruta","type":"SECURITY"},{"cwe":"419","description":"Consola(s) de administración se encuentran expuestas, lo cual puede permitir intentos de acceso administrativo no autorizados.","recommendation":"Restringir el acceso a las consolas administrativas a direcciones IP o segmentos de red de gestión explícitamente permitidos.","requirements":"REQ.0033. Si el sistema posee un mecanismo de administración, este debe ser accesible sólo desde segmentos de red de gestión o administrativos.","title":"FIN.S.0054. Servicios administrativos expuestos","type":"SECURITY"},{"cwe":"275","description":"-","recommendation":"Configurar de manera segura el servicio vulnerable permitiendo así que solo sea accedido por usuarios autorizados.","requirements":"REQ.0266. La organización debe deshabilitar las funciones inseguras de un sistema. (hardening de sistemas)","title":"FIN.S.0055. Configuración insegura del servicio","type":"SECURITY"},{"cwe":"285","description":"Debido a una mala configuración en los servicios del servidor (Ej: Servicio FTP usuario:Anonymous y contraseña:guest), se pueden realizar conexiones anónimas permitiendo así acceder a recursos, funcionalidades.","recommendation":"Configurar los servicios para que no se pueda enumerar los servicios o conectarse a estos de forma anónima.","requirements":"REQ.0264. El sistema debe requerir autenticación para todos los recursos, excepto para la consulta o visualización de aquellos específicamente clasificados como públicos.","title":"FIN.S.0056. Conexión anónima","type":"SECURITY"},{"cwe":"284","description":"Los servicios SMTP permite la conexión anónima y lo que le permite a un atacante usarlos para enviar correos sin autorización.","recommendation":"Configurar el servicio SMTP para que no permita una conexión anónima.","requirements":"REQ.0266. La organización debe deshabilitar las funciones inseguras de un sistema. (hardening de sistemas)","title":"FIN.S.0057. Envío de correo electrónico sin autorización","type":"SECURITY"},{"cwe":"215","description":"El sistema tiene el modo debug activo lo que genera una fuga de información cuando se genera un error.","recommendation":"Asegurarse que no esté habilitado el modo depuración en el ambiente de producción y remover las sentencias o porciones de código que se ejecutan en modo depuración.","requirements":"REQ.0078. Los eventos con severidad de depuración no deben estar habilitados en producción.","title":"FIN.H.0058. Depuración habilitada en producción","type":"HYGIENE"},{"cwe":"532","description":"En los logs se está guardando información sensible como credenciales, IP's, cuentas bancarias, rutas de archivos.","recommendation":"Verificar que la información que se está guardando en las bitácoras no sea sensible para el negocio.","requirements":"REQ.0083. El sistema no debe registrar información sensible en un evento excepcional de una bitácora.","title":"FIN.S.0059. Información sensible almacenada en bitácoras","type":"SECURITY"},{"cwe":"388","description":"La captura de excepciones demasiado amplias opaca el problema que generó el error y promueve en el código un manejo de errores genérico para diferentes categorías o fuentes de error, haciendo la aplicación tender a vulnerabilidades de seguridad.\n\nUsar un 'catch' para capturar una clase de alto nivel como 'Exception' puede ocultar excepciones que merecen un tratamiento especial o que no deben capturarse en este punto del programa. Anula el propósito de las excepciones tipificadas (por ejemplo 'ValueError', 'ConnectionError', 'NullPointerException', entre otras), y puede ser particularmente peligrosa si el programa crece y comienza a lanzar nuevos tipos de excepciones, pues los nuevos tipos de excepciones no recibirán ninguna atención al ser atrapados por el 'catch Exception'.","recommendation":"Capturar excepciones de manera específica y dar un tratamiento especial a cada una de ellas","requirements":"REQ.0161. El código debe definir opciones por defecto seguras que garanticen fallos seguros en la aplicación. (try, catch/except; default en switches)","title":"FIN.H.0060. Excepciones inseguras","type":"HYGIENE"},{"cwe":"388","description":"Los errores generados en la aplicación no lanzan ninguna excepción o guardado en logs para saber dónde se generaron\n","recommendation":"Asegurarse de que todos lo errores o peticiones mal formadas se guarden en un log permitiendo trazar la ruta hacia la funcionalidad que pudo haber sido víctima de un intento de ataque.","requirements":"REQ.0075. El sistema debe registrar todos los eventos excepcionales y de seguridad en bitácoras.","title":"FIN.H.0061. Errores sin trazabilidad","type":"HYGIENE"},{"cwe":"384","description":"La aplicación no valida el número de sesiones por usuario permitiéndole a un usuario iniciar sesión con las mismas credenciales más de una vez en un mismo momento. Además, la aplicación no informa cuando ya existe una sesión ni cuando se inicia sesión desde otra ubicación.","recommendation":"El sistema debe restringir el número de sesiones concurrentes que puede establecer un usuario y a su vez notificar al usuario cuando se inicie sesión en otra ubicación.","requirements":"REQ.0025. Las sesiones concurrentes de un sistema se deben controlar o informar","title":"FIN.H.0062. Sesiones concurrentes","type":"HYGIENE"},{"cwe":"20","description":"La aplicación no controla del lado de servidor que se tenga permiso de modificar ciertos campos y permite utilizar datos inválidos en algunos campos, por ejemplo una cédula compuesta por solo letras.","recommendation":"Validar en el lado del servidor los tipos de datos que se ingresan a distintos tipos de campos en la aplicación.","requirements":"REQ.0173. El sistema debe descartar toda la información potencialmente insegura que sea recibida por entradas de datos.","title":"FIN.S.0063. Falta de validación de datos","type":"SECURITY"},{"cwe":"388","description":"Se pueden enviar peticiones sin autenticación y con cualquier definición en un campo de la aplicación o editando la petición, lo que afecta la trazabilidad del sistema.","recommendation":"Asegurarse de que todos los errores generados en la aplicación se guarden en una o más bitácoras para futuras auditorías o para poder trazar una ruta más rápida para detectar un error.","requirements":"REQ.0075. El sistema debe registrar todos los eventos excepcionales y de seguridad en bitácoras.","title":"FIN.H.0064. Pérdida de trazabilidad","type":"HYGIENE"},{"cwe":"524","description":"El formulario no deshabilita la característica de autocompletado, por lo que la información quedará almacenada en el caché del navegador.","recommendation":"El caché de datos a nivel de navegador se debe deshabilitar usando alguno de estos métodos:\n- Usar cabeceras de control HTTP que prevengan caché.\n- Usar meta-tags en las páginas HTML.\n- Usar autocomplete=off para prevenir caché a nivel de campos.","requirements":"REQ.0177. El sistema no debe almacenar información sensible en archivos temporales o en memoria caché.","title":"FIN.S.0065. Caché en formulario","type":"SECURITY"},{"cwe":"649","description":"El sistema tiene código javascript que contiene información del negocio sin ofuscar, lo que le permite a un atacante identificar rutas, validaciones y parámetros que éste utiliza. ","recommendation":"Realizar un proceso de ofuscación al código expuesto en las aplicaciones web.","requirements":"REQ.0159. El código fuente debe estar ofuscado en ambiente de producción.","title":"FIN.H.0066. Código JavaScript sin ofuscar","type":"HYGIENE"},{"cwe":"474","description":"El sistema invierte recursos de máquina innecesarios debido que se usan malas prácticas de programación.","recommendation":"Utilizar librerías estables y optimizadas para realizar funciones sin mucho gasto computacional.","requirements":"REQ.0158. La codificación del sistema debe estar implementada en una versión de un lenguaje de programación estable, actualizada, probada y libre de vulnerabilidades conocidas.","title":"FIN.S.0067. Pérdida de rendimiento de la aplicación","type":"SECURITY"},{"cwe":"613","description":"La sesión de usuario de la aplicación no expira después de 5 minutos de inactividad.","recommendation":"Cerrar las sesiones cuando permanezcan inactivas más de 5 minutos\n","requirements":"REQ.0023. El sistema debe cerrar una sesión si se presenta un tiempo de inactividad por parte del usuario, superior o igual a 5 minutos.","title":"FIN.H.0068. Tiempo límite de inactividad inseguro","type":"HYGIENE"},{"cwe":"804","description":"El formulario presenta una función de captcha insegura que permite automatizar la lectura y uso de la información de validación con herramientas de reconocimiento óptico.","recommendation":"Asegurarse que la respuesta del captcha se encuentre a nivel de servidor y no expuesto en el HTML de la web, también asegurarse que el Captcha no sea leído por un OCR.","requirements":"REQ.0237. El sistema debe garantizar que quien realiza las acciones de registro, autenticación y restablecimiento de contraseña es un humano (usando CAPTCHA o retrasos incrementales)","title":"FIN.S.0069. Captcha débil","type":"SECURITY"},{"cwe":"398","description":"Dentro del código existen sentencias inseguras usando muchos recursos de la máquina, lo cual afecta el rendimiento y el tiempo de respuesta de la aplicación.","recommendation":"Utilizar las librerías que permiten ejecutar las funciones de concatenado y almacenamiento en colecciones de manera optimizada.(ArrayList y StringBuilder o SyncronizedList).","requirements":"REQ.0158. La codificación del sistema debe estar implementada en una versión de un lenguaje de programación estable, actualizada, probada y libre de vulnerabilidades conocidas.","title":"FIN.H.0070. Prácticas inadecuadas de programación","type":"HYGIENE"},{"cwe":"116","description":"La aplicación posee código javascript minimizado para evitar que sea legible, un atacante puede revertirlo mediante herramientas online y es fácil para un atacante poder visualizar y entender este código.","recommendation":"Realizar un proceso de ofuscación fuerte al código expuesto en las aplicaciones web.","requirements":"REQ.0159. El código fuente debe estar ofuscado en ambiente de producción.","title":"FIN.H.0071. Código ofuscado de forma insegura","type":"HYGIENE"},{"cwe":"","description":"Se encuentra código que se encuentra repetido en diferentes archivos del código fuente lo que puede generar comportamientos inesperados en la aplicación. ","recommendation":"Asegurarse de que el código fuente no tenga clases, funciones o métodos repetidos.","requirements":"REQ.0167. El código fuente no debe tener funciones, métodos o clases repetidas.","title":"FIN.H.0072. Código repetido","type":"HYGIENE"},{"cwe":"478","description":"El código presenta condicionales sin ninguna opción por defecto. Ejemplo: se tiene un case que no contempla una opción a seguir en caso de que no se cumpla la condición.","recommendation":"Definir una opción por defecto para las sentencias que aún no cuentan con esta.","requirements":"REQ.0161. El código debe definir opciones por defecto seguras que garanticen fallos seguros en la aplicación. (try, catch/except; default en switches)","title":"FIN.H.0073. Condicionales sin opción por defecto","type":"HYGIENE"},{"cwe":"546","description":"Existe código comentado en ambiente de producción, lo que aumenta la probabilidad de que, en ambientes de desarrollo, puedan remover los comentarios de este código y desplegarlo en producción.","recommendation":"Eliminar todas las líneas de código funcional comentado en el código fuente de la aplicación.\r","requirements":"REQ.0171. Los comentarios del código fuente en ambiente de producción deben ser removidos.","title":"FIN.H.0074. Código funcional comentado","type":"HYGIENE"},{"cwe":"538","description":"-","recommendation":"-","requirements":"REQ.0176. El sistema debe restringir el acceso a objetos del sistema que tengan contenido sensible. Sólo permitirá su acceso a usuarios autorizados.","title":"FIN.S.0075. Acceso no autorizado a archivos","type":"SECURITY"},{"cwe":"930","description":"El token de sesión no caduca una vez que el usuario cierra la sesión y se puede reutilizar en futuras solicitudes.","recommendation":"El token de sesión debe caducar cuando se cierra una sesión.","requirements":"REQ.0141. El sistema debe forzar a un usuario a realizar nuevamente el proceso de autenticación o invalidar la sesión en el sistema una vez que haya ocurrido un cambio en el estado del usuario (cambio o restauración de su contraseña, bloqueo, borrado del usuario, deshabilitación del usuario, etc)\nREQ.0030. Se debe controlar que un objeto (id de sesión, cookie, etc) que participe en el proceso de autenticación no pueda ser reutilizado.\nREQ.0031. Al cerrarse la sesión de un usuario (automática o manual) se debe descartar los datos relacionados con la sesión del usuario.","title":"FIN.S.0076. Manejo inseguro de sesión","type":"SECURITY"},{"cwe":"290","description":"Es posible suplantar direcciones MAC en la red, debido a que el suiche asociado no cuenta con protecciones como PortSecurity.","recommendation":"Establecer controles de red (PortSecurity) en los switches afectados","requirements":"REQ.0062. Debe definirse configuraciones estándares que corrijan todas las vulnerabilidades conocidas y que sean consistentes con estándares de la industria (ej: líneas base).","title":"FIN.S.0077. ARP Spoofing","type":"SECURITY"},{"cwe":"330","description":"Es posible revertir el hash del token y obtener la información que enmascara ya que no se usa un componente aleatorio aún siendo un hash ya usado.","recommendation":"Generar un token con componentes aleatorios sin información sensible.","requirements":"REQ.0224. Debe usarse el mecanismo criptográfico más seguro ofrecido por la plataforma (ej: java.security.SecureRandom) para la generación de números aleatorios usados en procesos críticos (ej: generación de ID, mapeo de códigos, llaves).","title":"FIN.S.0078. Token generado de forma insegura","type":"SECURITY"},{"cwe":"829","description":"Las dependencias no se encuentran explícitamente declaradas (nombre y versión) dentro del código fuente. Se encuentran copiadas directamente en los repositorios","recommendation":"Todas las dependencias deben estar declaradas y se deben referenciar con un gestor de dependencias (npm, pip, maven). Esto permite estandarizar la construcción y empaquetado de proyectos.","requirements":"REQ.0302. Las dependencias (software de terceros/librerías) deben ser declaradas explícitamente (nombre y versión) en un archivo dentro del código fuente.","title":"FIN.H.0079. Dependencias no actualizables","type":"HYGIENE"},{"cwe":"0","description":"-","recommendation":"-","requirements":"REQ.0101. La organización debe garantizar que todo el personal que realiza actividades al interior de las instalaciones debe estar carnetizado y contar con las tarjetas del sistema de control de accesos correspondientes.","title":"FIN.S.0080. Controles de acceso físico inadecuados","type":"SECURITY"},{"cwe":"308","description":"Los servicios críticos sobre la red interna como acceso a bases de datos, recursos compartidos con información sensible y/o web services, no cuentan con un doble factor de autenticación lo cual hace más fácil para un atacante con un usuario comprometido acceder a estos","recommendation":"Implementar un doble factor de autenticación ya sea por software o hardware para incrementar el nivel de protección de la autenticación de los recursos críticos.","requirements":"REQ.0229. El sistema debe solicitar a cualquier actor que intenta autenticarse, como mínimo un nombre de usuario y una contraseña.","title":"FIN.S.0081. Ausencia de doble factor de autenticación","type":"SECURITY"},{"cwe":"0","description":"Es posible recuperar archivos con información sensible de las papeleras de reciclaje, esto porque no se eliminan una vez estan allí o no se hace siguiendo un protocolo seguro.","recommendation":"Se deben seguir las buenas prácticas para la limpieza, eliminación y destrucción de información sensible (Políticas)","requirements":"REQ.0183. El sistema debe soportar la eliminación segura de datos sensibles cuando estos ya no son requeridos, de tal forma que no puedan ser recuperados.","title":"FIN.S.0082. Archivos eliminados de forma insegura","type":"SECURITY"},{"cwe":"91","description":"La aplicación afectada permite la inyección de código XML que es ejecutado de forma remota y permite la exfiltración de archivos o ejecución remota de comandos","recommendation":"Filtrar la información que recibe y envía la aplicación por medio de listas blancas","requirements":"REQ.0173. El sistema debe descartar toda la información potencialmente insegura que sea recibida por entradas de datos.","title":"FIN.S.0083. Inyección XML (XXE)","type":"SECURITY"},{"cwe":"290","description":"Es posible interceptar peticiones a los servicios de MDNS y obtener informacion de los hosts conectados debido a que no se cuenta con medidas de seguridad en la red","recommendation":"Deshabilitar LLMNR y NBT-NS. Configurar el firewall para filtrar conexiones provenientes del puerto UDP 5353","requirements":"REQ.0062. Deben definirse configuraciones estándares que corrijan todas las vulnerabilidades conocidas y que sean consistentes con estándares de la industria (ej: líneas base).","title":"FIN.S.0084. MDNS Spoofing","type":"SECURITY"},{"cwe":"922","description":"La aplicación almacena informacion sensible sin limitar adecuadamente el acceso de lectura y escritura por actores no autorizados.","recommendation":"No usar el almacenamiento local (JavaScript's LocalStorage) para almacenar datos sensibles. Usar cookies en su lugar, pero siguiendo las politicas de seguridad de Cookies.","requirements":"REQ.0177. El sistema no debe almacenar información sensible en archivos temporales o en memoria caché.","title":"FIN.S.0085. Almacenamiento inseguro de información sensible en el local storage","type":"SECURITY"},{"cwe":"16","description":"La aplicación no valida adecuadamente la integridad de los recursos cargados de servidores de terceros.","recommendation":"Validar el hash de todos los recursos que provengan de fuentes controladas por terceros","requirements":"-","title":"FIN.S.0086. Falta de verificación de HTML Subresource Integrity","type":"SECURITY"},{"cwe":"74","description":"Es posible inyectar formulas en los campos que luego son exportados en CSV e interpretados por Excel","recommendation":"Sanitizar todos los campos a exportar en el servidor al generar el archivo exportado\n","requirements":"REQ.0173. El sistema debe descartar toda la información potencialmente insegura que sea recibida por entradas de datos.","title":"FIN.S.0090. Inyección de Código (CSV)","type":"SECURITY"},{"cwe":"74","description":"Se guardan entradas sin validar en los logs del sistema, permitiendo la inyección de entradas maliciosas","recommendation":"Sanitizar entradas antes de guardarlas en el log","requirements":"REQ.0173. El sistema debe descartar toda la información potencialmente insegura que sea recibida por entradas de datos.","title":"FIN.S.0091. Inyección en Logs","type":"SECURITY"},{"cwe":"400","description":"Es posible enviar peticiones construidas para consumir indiscriminadamente recursos del servidor\n","recommendation":"No procesar entradas que impliquen un consumo de recursos por encima de  lo normal\n","requirements":"REQ.0173. El sistema debe descartar toda la información potencialmente insegura que sea recibida por entradas de datos.","title":"FIN.S.0092. Asignación inadecuada de recursos","type":"SECURITY"},{"cwe":"472","description":"Es posible modificar campos invisibles al usuario para forzar la aplicación a comportarse de manera inadecuada\n","recommendation":"Enviar en las peticiones solo los campos que requieran entradas del usuario y manejar el resto desde el servidor","requirements":"REQ.0176. El sistema debe restringir el acceso a objetos del sistema que tengan contenido sensible. Sólo permitirá su acceso a usuarios autorizados","title":"FIN.S.0093. Manipulación de campos invisibles","type":"SECURITY"},{"cwe":"472","description":"Es posible enviar mensajes a un usuario que parezcan venir del sistema","recommendation":"Proteger correctamente los métodos de comunicación con el usuario\n","requirements":"REQ.030 Avoid object reutilization.","title":"FIN.S.0094. Suplantación de identidad","type":"SECURITY"},{"cwe":"338","description":"La entropía de un componente aleatorio es muy baja, permitiendo potencialmente a un atacante utilizar técnicas probabilísticas para predecir resultados","recommendation":"Utilizar generadores realmente aleatorios para funcionallidades que lo requieran","requirements":"REQ.0223. Los números aleatorios generados deben seguir una distribución uniforme.","title":"FIN.S.0095. Entropía insuficiente\n","type":"SECURITY"},{"cwe":"502","description":"Se deserializan objetos sin validar su contenido ni forzar su tipo.","recommendation":"Validar los objetos serializados entrantes y solo deserializarlos si cumplen con las propiedades esperadas.","requirements":"REQ.0173. El sistema debe descartar toda la información potencialmente insegura que sea recibida por entradas de datos.","title":"FIN.S.0096. Deserialización Insegura","type":"SECURITY"},{"cwe":"1022","description":"Es posible crear un link a un sitio externo controlado por un actor malicioso, que realice un reverse tabnabbing redirigiendo al usuario a otro sitio en la pestaña original.","recommendation":"Establecer rel=noopener en cada link externo.","requirements":"REQ.0173. El sistema debe descartar toda la información potencialmente insegura que sea recibida por entradas de datos.","title":"FIN.S.0097. Reverse Tabnabbing","type":"SECURITY"},{"cwe":"73","description":"Se puede modificar la ruta donde se almacenará un archivo cargado en el sistema.","recommendation":"Validar el nombre de los archivos cargados en el sistema y restringir el almacenamiento solo a las carpetas destinadas.","requirements":"REQ.0037 El sistema no debe incluir en parámetros nombres de directorios o rutas de archivos.","title":"FIN.S.0098. Control externo de ruta en guardado de archivo","type":"SECURITY"},{"cwe":"250","description":"Se otorga a un rol o usuario más privilegios que los estrictamente necesarios","recommendation":"Otorgar privilegios estrictamente a los roles que lo necesitan","requirements":"REQ.186 Use minimum level of privileges","title":"FIN.S.0099. Exceso de privilegios","type":"SECURITY"},{"cwe":"918","description":"El servidor recibe un URL o un request similar a través de entrada de datos y consulta el contenido de este URL, pero no garantiza que la petición se realice al destino esperado.","recommendation":"El sistema debe impedir que la consulta de información de parte del servidor sea controlada por los usuarios. Si esto es necesario, el sistema debe restringir los endpoints aceptados para consulta.","requirements":"REQ.0173. El sistema debe descartar toda la información potencialmente insegura que sea recibida por entradas de datos.","title":"FIN.S.0100. Server Side Request Forgery (SSRF)","type":"SECURITY"},{"cwe":"404","description":"-","recommendation":"-","requirements":"-","title":"FIN.S.0101. Ausencia de protección contra borrado","type":"SECURITY"},{"cwe":"345","description":"Se está haciendo una verificación parcial de unicidad de correos electrónicos, ya que el caracter \"+\" en la parte del usuario del correo no se filtra adecuadamente. Esto hace que \"usuario@ejemplo.com\", \"usuario+1@ejemplo.com\" y \"usuario+2000@ejemplo.com\" se tomen como diferentes personas/cuentas cuando en realidad todas esas direcciones llegan al mismo buzón de correo \"usuario@ejemplo.com\". Igualmente ocurre con el caracter \".\" en correos de manejados por Google. Esta falta de verificación podría llevar a que existan dos cuentas independientes con la misma dirección de correo.","recommendation":"El sistema debe validar los correos de manera que un mismo buzón solo pueda estar asociado y/o representar una cuenta.","requirements":"REQ.0121 Sistemas que empleen cuentas de correo para el registro de usuarios deben garantizar la unicidad de los correos, siguiendo el estándar de la estructura de dirección de correo RFC822. ","title":"FIN.S.0102. Ausencia de validación de unicidad de correos","type":"SECURITY"},{"cwe":"345","description":"El sistema no hace una verificación suficiente del origen o la autenticidad de la información, ocasionando que se acepten datos inválidos.","recommendation":"El sistema debe validar la autenticidad de los datos que son recibidos como parámetros ingresados por el usuario.","requirements":"REQ.0173. El sistema debe descartar toda la información potencialmente insegura que sea recibida por entradas de datos.","title":"FIN.S.0103. Verificación de autenticidad de datos insuficiente","type":"SECURITY"},{"cwe":"1203","description":"Es posible conectar dispositivos USB al equipo que permiten infectarlo con software malicioso.","recommendation":"- Establecer controles de acceso físico que impidan la conexión de dispositivos periféricos no autorizados.\n- Instalar una suite de seguridad apropiada en las estaciones de trabajo que mitigue el riesgo de infección con software malicioso","requirements":"REQ.273. Todas las estaciones de trabajo en producción deben contar con una suite de seguridad inalterable (Anti-virus, Antispyware, Host Firewall, Host-IDS, Host-IPS).","title":"FIN.S.0104. Ataques con memorias USB","type":"SECURITY"},{"cwe":"74","description":"Se generan sentencias Apache Lucene Query dinámicas sin la validación requerida de datos y sin utilizar sentencias parametrizadas o procedimientos almacenados.","recommendation":"Realizar las consultas a la base de datos por medio de sentencias o procedimientos parametrizados.","requirements":"REQ.0169. Deben usarse construcciones parametrizadas o procedimientos almacenados parametrizados para la creación dinámica de sentencias.","title":"FIN.S.0105. Inyección Apache Lucene Query","type":"SECURITY"},{"cwe":"74","description":"Se generan sentencias NoSQL dinámicas sin la validación requerida de datos.","recommendation":"Validar y escapar los datos que serán incluidos en sentencias generadas dinámicamente.","requirements":"REQ.0173. El sistema debe descartar toda la información potencialmente insegura que sea recibida por entradas de datos.","title":"FIN.S.0106. Inyección NoSQL","type":"SECURITY"},{"cwe":"74","description":"Se generan sentencias LDAP dinámicas sin la validación requerida de datos.","recommendation":"Validar y escapar los datos que serán incluidos en sentencias generadas dinámicamente.","requirements":"REQ.0173. El sistema debe descartar toda la información potencialmente insegura que sea recibida por entradas de datos.","title":"FIN.S.0107. Inyección LDAP","type":"SECURITY"},{"cwe":"799","description":"La aplicación no limita la cantidad de peticiones (rate limit) que puede realizar un cliente en un intervalo reducido de tiempo","recommendation":"Limitar la cantidad de peticiones que puede realizar un mismo host en espacios de tiempo definidos","requirements":"REQ.0072. El tiempo de respuesta con la concurrencia máxima esperada debe ser de no más de 5 segundos.","title":"FIN.S.0108. Control inadecuado de frecuencia de interacción","type":"SECURITY"},{"cwe":"398","description":"Existen archivos binarios en los repositorios sin su correspondiente código fuente, los cuales podrían ser de naturaleza maliciosa, tener vulnerabilidades o almacenar información sensible.","recommendation":"Incluir en el repositorio el código fuente correspondiente de los binarios que no lo tienen.","requirements":"REQ.0051. La organización debe almacenar el código fuente en un repositorio central.","title":"FIN.H.0109. Código funcional incompleto","type":"HYGIENE"},{"cwe":"444","description":"Es posible enviar peticiones HTTP malformadas o anormales que son interpretadas por una o más entidades entre el cliente y el servidor, como un proxy o un firewall, que son interpretadas inconsistentemente, permitiendo que un atacante haga llegar una petición a un dispositivo sin que el otro se percate.","recommendation":"Usar el mismo software de web server en los servidores de front-end y back-end, de manera que concidan en los delimitadores entre las peticiones.","requirements":"REQ.0173. El sistema debe descartar toda la información potencialmente insegura que sea recibida por entradas de datos.","title":"FIN.S.0110. HTTP Request Smuggling","type":"SECURITY"},{"cwe":"125","description":"El sistema lee datos más allá del final, o antes del comienzo, del buffer o porción de memoria asignado originalmente.","recommendation":"-","requirements":"REQ.0176. El sistema debe restringir el acceso a objetos del sistema que tengan contenido sensible. Sólo permitirá su acceso a usuarios autorizados.","title":"FIN.S.0111. Out-of-bounds Read","type":"SECURITY"},{"cwe":"1176","description":"El programa computa usando algoritmos que que no son tan eficientes como podrían serlo para las necesidades del desarrollador, es decir, los cómputos todavía se pueden optimizar.","recommendation":"-","requirements":"REQ.0174. El código debe usar contenedores de datos y estructuras optimizadas.","title":"FIN.H.0112. Uso ineficiente de CPU","type":"HYGIENE"},{"cwe":"704","description":"Se usan variables sin declaración de tipo específico, conviertiéndolas en variantes, lo cual hace que se requira identificar y convertir el tipo de dato que será usado en cada interacción.","recommendation":"-","requirements":"REQ.0158. La codificación del sistema debe estar implementada en una versión de un lenguaje de programación estable, actualizada, probada y libre de vulnerabilidades conocidas.","title":"FIN.H.0113. Conversión de tipo incorrecta","type":"HYGIENE"},{"cwe":"451","description":"Los usuarios son vulnerables a phishing, una técnica de ingeniería social donde un atacante se disfraza como una entidad legítima con la que la víctima tiene contacto para solicitarle a la misma que revele información confidencial (frecuentemente credenciales).","recommendation":"-","requirements":"REQ.0115. Los correos entrantes y salientes deben ser verificados con un filtro anti-spam.\nREQ.0116. El cliente del correo empresarial no debe mostrar por defecto imágenes cuyo origen sea desconocido.\nREQ.0117. El cliente del correo empresarial no debe renderizar código HTML por defecto.\nREQ.0118. Se deben escanear los archivos adjuntos en un correo con herramientas anti-malware.\nREQ.0144. La organización debe purgar las cuentas de usuario periódicamente.","title":"FIN.S.0114. Phishing","type":"SECURITY"},{"cwe":"0","description":"-","recommendation":"-","requirements":"REQ.273. Todas las estaciones de trabajo en producción deben contar con una suite de seguridad inalterable (Anti-virus, Antispyware, Host Firewall, Host-IDS, Host-IPS).\n","title":"FIN.S.0115. Evasión de controles de seguridad","type":"SECURITY"}]